; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 555468 2 1 3 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	infrared2 - mode
	thermograph1 - mode
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Star7)
	(have_image Planet8 thermograph1)
	(have_image Star9 infrared2)
	(have_image Phenomenon10 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
3. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 5
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
6. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 5
7. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   goals met: 2 of 5
8. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 5
9. (turn_to satellite1 phenomenon10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 5
10. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
11. (take_image satellite1 phenomenon10 instrument1 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 1 of 5
12. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 1 of 5
13. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 1 of 5
14. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   goals met: 2 of 5
15. (take_image satellite1 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 3 of 5
16. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 4 of 5
17. (turn_to satellite1 star7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star7)
   goals met: 5 of 5
